Revit 2027 API
MacroManagerIterator.Dispose Method
Releases all resources used by the MacroManagerIterator
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Dispose()
Public Sub Dispose
public:
virtual void Dispose() sealed
abstract Dispose : unit -> unit
override Dispose : unit -> unit
See Also
Reference
MacroManagerIterator Class
Autodesk.Revit.DB.Macros Namespace